<details ><summary>plan for oracle-network 2025-08-13 15:14:04 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#oracle-network has been locked by PR #11
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # oci_core_security_list.security_list_private_shared will be created
  + resource "oci_core_security_list" "security_list_private_shared" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags   = (known after apply)
      + display_name   = "security-list-private-shared"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "6"
          + stateless        = false

          + tcp_options {
              + max = 587
              + min = 587
            }
        }
    }

  # oci_core_subnet.subnet_shared_private will be created
  + resource "oci_core_subnet" "subnet_shared_private" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "subnet-shared-private"
      + dns_label                  = "private"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.vcn_shared.oci_core_default_security_list.lockdown[0] will be created
  + resource "oci_core_default_security_list" "lockdown" {
      + compartment_id             = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = (known after apply)
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + manage_default_resource_id = (known after apply)
      + state                      = (known after apply)
      + time_created               = (known after apply)
    }

  # module.vcn_shared.oci_core_nat_gateway.nat_gateway[0] will be created
  + resource "oci_core_nat_gateway" "nat_gateway" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags   = (known after apply)
      + display_name   = "nat-shared"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + nat_ip         = (known after apply)
      + public_ip_id   = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.vcn_shared.oci_core_route_table.nat[0] will be created
  + resource "oci_core_route_table" "nat" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags   = (known after apply)
      + display_name   = "nat-route"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at NAT Gateway creation: NAT Gateway as default gateway"
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at Service Gateway creation: All Services in region to Service Gateway"
          + destination       = "all-sin-services-in-oracle-services-network"
          + destination_type  = "SERVICE_CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.vcn_shared.oci_core_route_table.service_gw[0] will be created
  + resource "oci_core_route_table" "service_gw" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags   = (known after apply)
      + display_name   = "service-gw-route"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at Service Gateway creation: All Services in region to Service Gateway"
          + destination       = "all-sin-services-in-oracle-services-network"
          + destination_type  = "SERVICE_CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.vcn_shared.oci_core_service_gateway.service_gateway[0] will be created
  + resource "oci_core_service_gateway" "service_gateway" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags   = (known after apply)
      + display_name   = "sg-shared"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + services {
          + service_id   = "ocid1.service.oc1.ap-singapore-1.aaaaaaaagnk23xjbfwkz2vlbnad4pvhi4l5idlqismigynvidjildotx2rwq"
          + service_name = (known after apply)
        }
    }

  # module.vcn_shared.oci_core_vcn.vcn will be created
  + resource "oci_core_vcn" "vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "vcn_shared"
      + dns_label                        = "shared"
      + freeform_tags                    = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = false
      + is_oracle_gua_allocation_enabled = (known after apply)
      + security_attributes              = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>